Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/m13design/m13_ra6m4_ek/https_server_demo/keil/startup_ra6m4.S
                DCD     GPT5_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT5_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT5_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_PC != BSP_IRQ_DISABLED
                DCD     GPT5_PC_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT6_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT6_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT6_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT6_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT6_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT6_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT6_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT6_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_PC != BSP_IRQ_DISABLED
                DCD     GPT6_PC_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT7_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT7_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT7_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT7_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT7_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT7_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT7_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT7_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT8_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT8_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT8_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT8_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT8_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT8_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT8_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT8_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT9_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT9_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT9_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT9_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT9_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT9_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT9_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT9_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_OPS_UVW_EDGE != BSP_IRQ_DISABLED
                DCD     OPS_UVW_EDGE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_SCAN_END != BSP_IRQ_DISABLED
                DCD     ADC0_SCAN_END_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_SCAN_END_B != BSP_IRQ_DISABLED
                DCD     ADC0_SCAN_END_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_WINDOW_A != BSP_IRQ_DISABLED
                DCD     ADC0_WINDOW_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_WINDOW_B != BSP_IRQ_DISABLED
                DCD     ADC0_WINDOW_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_COMPARE_MATCH != BSP_IRQ_DISABLED
                DCD     ADC0_COMPARE_MATCH_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_COMPARE_MISMATCH != BSP_IRQ_DISABLED
                DCD     ADC0_COMPARE_MISMATCH_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC1_SCAN_END != BSP_IRQ_DISABLED
                DCD     ADC1_SCAN_END_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC1_SCAN_END_B != BSP_IRQ_DISABLED
                DCD     ADC1_SCAN_END_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC1_WINDOW_A != BSP_IRQ_DISABLED
                DCD     ADC1_WINDOW_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC1_WINDOW_B != BSP_IRQ_DISABLED
                DCD     ADC1_WINDOW_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC1_COMPARE_MATCH != BSP_IRQ_DISABLED
                DCD     ADC1_COMPARE_MATCH_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC1_COMPARE_MISMATCH != BSP_IRQ_DISABLED
                DCD     ADC1_COMPARE_MISMATCH_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EDMAC0_EINT != BSP_IRQ_DISABLED
                DCD     EDMAC0_EINT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_RXI != BSP_IRQ_DISABLED
                DCD     SCI0_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_TXI != BSP_IRQ_DISABLED
                DCD     SCI0_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_TEI != BSP_IRQ_DISABLED
                DCD     SCI0_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_ERI != BSP_IRQ_DISABLED
                DCD     SCI0_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_AM != BSP_IRQ_DISABLED
                DCD     SCI0_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_RXI_OR_ERI != BSP_IRQ_DISABLED
                DCD     SCI0_RXI_OR_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI1_RXI != BSP_IRQ_DISABLED
                DCD     SCI1_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI1_TXI != BSP_IRQ_DISABLED
                DCD     SCI1_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI1_TEI != BSP_IRQ_DISABLED
                DCD     SCI1_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI1_ERI != BSP_IRQ_DISABLED
                DCD     SCI1_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI2_RXI != BSP_IRQ_DISABLED
                DCD     SCI2_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI2_TXI != BSP_IRQ_DISABLED
                DCD     SCI2_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI2_TEI != BSP_IRQ_DISABLED
                DCD     SCI2_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI2_ERI != BSP_IRQ_DISABLED
                DCD     SCI2_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_RXI != BSP_IRQ_DISABLED
                DCD     SCI3_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_TXI != BSP_IRQ_DISABLED
                DCD     SCI3_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_TEI != BSP_IRQ_DISABLED
                DCD     SCI3_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_ERI != BSP_IRQ_DISABLED
                DCD     SCI3_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_AM != BSP_IRQ_DISABLED
                DCD     SCI3_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_RXI != BSP_IRQ_DISABLED
                DCD     SCI4_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_TXI != BSP_IRQ_DISABLED
                DCD     SCI4_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_TEI != BSP_IRQ_DISABLED
                DCD     SCI4_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_ERI != BSP_IRQ_DISABLED
                DCD     SCI4_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_AM != BSP_IRQ_DISABLED
                DCD     SCI4_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI5_RXI != BSP_IRQ_DISABLED
                DCD     SCI5_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI5_TXI != BSP_IRQ_DISABLED
                DCD     SCI5_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI5_TEI != BSP_IRQ_DISABLED
                DCD     SCI5_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI5_ERI != BSP_IRQ_DISABLED
                DCD     SCI5_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI5_AM != BSP_IRQ_DISABLED
                DCD     SCI5_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI6_RXI != BSP_IRQ_DISABLED
                DCD     SCI6_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI6_TXI != BSP_IRQ_DISABLED
                DCD     SCI6_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI6_TEI != BSP_IRQ_DISABLED
                DCD     SCI6_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI6_ERI != BSP_IRQ_DISABLED
                DCD     SCI6_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI6_AM != BSP_IRQ_DISABLED
                DCD     SCI6_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI7_RXI != BSP_IRQ_DISABLED
                DCD     SCI7_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI7_TXI != BSP_IRQ_DISABLED
                DCD     SCI7_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI7_TEI != BSP_IRQ_DISABLED
                DCD     SCI7_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI7_ERI != BSP_IRQ_DISABLED
                DCD     SCI7_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI7_AM != BSP_IRQ_DISABLED
                DCD     SCI7_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI8_RXI != BSP_IRQ_DISABLED
                DCD     SCI8_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI8_TXI != BSP_IRQ_DISABLED
                DCD     SCI8_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI8_TEI != BSP_IRQ_DISABLED
                DCD     SCI8_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI8_ERI != BSP_IRQ_DISABLED
                DCD     SCI8_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI8_AM != BSP_IRQ_DISABLED
                DCD     SCI8_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_RXI != BSP_IRQ_DISABLED
                DCD     SCI9_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_TXI != BSP_IRQ_DISABLED
                DCD     SCI9_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_TEI != BSP_IRQ_DISABLED
                DCD     SCI9_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_ERI != BSP_IRQ_DISABLED
                DCD     SCI9_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_AM != BSP_IRQ_DISABLED
                DCD     SCI9_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCIX0_SCIX0 != BSP_IRQ_DISABLED
                DCD     SCIX0_SCIX0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCIX0_SCIX1 != BSP_IRQ_DISABLED
                DCD     SCIX0_SCIX1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCIX0_SCIX2 != BSP_IRQ_DISABLED
                DCD     SCIX0_SCIX2_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCIX0_SCIX3 != BSP_IRQ_DISABLED
                DCD     SCIX0_SCIX3_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCIX1_SCIX0 != BSP_IRQ_DISABLED
                DCD     SCIX1_SCIX0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCIX1_SCIX1 != BSP_IRQ_DISABLED
                DCD     SCIX1_SCIX1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCIX1_SCIX2 != BSP_IRQ_DISABLED
                DCD     SCIX1_SCIX2_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCIX1_SCIX3 != BSP_IRQ_DISABLED
                DCD     SCIX1_SCIX3_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_RXI != BSP_IRQ_DISABLED
                DCD     SPI0_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_TXI != BSP_IRQ_DISABLED
                DCD     SPI0_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_IDLE != BSP_IRQ_DISABLED
                DCD     SPI0_IDLE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_ERI != BSP_IRQ_DISABLED
                DCD     SPI0_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_TEI != BSP_IRQ_DISABLED
                DCD     SPI0_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI1_RXI != BSP_IRQ_DISABLED
                DCD     SPI1_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI1_TXI != BSP_IRQ_DISABLED
                DCD     SPI1_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI1_IDLE != BSP_IRQ_DISABLED
                DCD     SPI1_IDLE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI1_ERI != BSP_IRQ_DISABLED
                DCD     SPI1_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI1_TEI != BSP_IRQ_DISABLED
                DCD     SPI1_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_OSPI_INT != BSP_IRQ_DISABLED
                DCD     OSPI_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_QSPI_INT != BSP_IRQ_DISABLED
                DCD     QSPI_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DOC_INT != BSP_IRQ_DISABLED
                DCD     DOC_INT_IRQHandler
                ENDIF
__Vectors_End

__Vectors_Size  EQU  __Vectors_End - __Vectors

                FILL    (0x400 - __Vectors_Size), 0xFFFFFFFF, 4

__Options       FILL    0x100, 0xFFFFFFFF, 4

                AREA    |.text|, CODE, READONLY

