Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/m13design/m13_ra6m4_ek/https_server_demo/keil/startup_ra6m4.S
; Reset handler
Reset_Handler    PROC
                 EXPORT  Reset_Handler             [WEAK]
        IMPORT  SystemInit
        IMPORT  __main

                 ; Set vector table offset
                 LDR     R0, =0xE000ED08
                 LDR     R1, =__Vectors
                 STR     R1, [R0]

                 LDR     R0, =SystemInit
                 BLX     R0
                 LDR     R0, =__main
                 BX      R0
                 ENDP

; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler                [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler          [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler          [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler           [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler         [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler                [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler           [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler             [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler            [WEAK]
                B       .
                ENDP

Default_Handler PROC
                EXPORT  ICU_IRQ0_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ1_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ2_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ3_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ4_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ5_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ6_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ7_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ8_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ9_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ10_IRQHandler              [WEAK]
                EXPORT  ICU_IRQ11_IRQHandler              [WEAK]
                EXPORT  ICU_IRQ12_IRQHandler              [WEAK]
                EXPORT  ICU_IRQ13_IRQHandler              [WEAK]
                EXPORT  ICU_IRQ14_IRQHandler              [WEAK]
                EXPORT  ICU_IRQ15_IRQHandler              [WEAK]
                EXPORT  DMAC0_INT_IRQHandler              [WEAK]
                EXPORT  DMAC1_INT_IRQHandler              [WEAK]
                EXPORT  DMAC2_INT_IRQHandler              [WEAK]
                EXPORT  DMAC3_INT_IRQHandler              [WEAK]
                EXPORT  DMAC4_INT_IRQHandler              [WEAK]
                EXPORT  DMAC5_INT_IRQHandler              [WEAK]
                EXPORT  DMAC6_INT_IRQHandler              [WEAK]
                EXPORT  DMAC7_INT_IRQHandler              [WEAK]
                EXPORT  DTC_TRANSFER_IRQHandler           [WEAK]
                EXPORT  DTC_COMPLETE_IRQHandler           [WEAK]
                EXPORT  DTC_END_IRQHandler                [WEAK]
                EXPORT  DMA_TRANSERR_IRQHandler           [WEAK]
                EXPORT  ICU_SNOOZE_CANCEL_IRQHandler      [WEAK]
                EXPORT  FCU_FIFERR_IRQHandler             [WEAK]
                EXPORT  FCU_FRDYI_IRQHandler              [WEAK]
                EXPORT  LVD_LVD1_IRQHandler               [WEAK]
                EXPORT  LVD_LVD2_IRQHandler               [WEAK]
                EXPORT  CGC_MOSC_STOP_IRQHandler          [WEAK]
                EXPORT  LPM_SNOOZE_REQUEST_IRQHandler     [WEAK]
                EXPORT  AGT0_INT_IRQHandler               [WEAK]
                EXPORT  AGT0_COMPARE_A_IRQHandler         [WEAK]
                EXPORT  AGT0_COMPARE_B_IRQHandler         [WEAK]
                EXPORT  AGT1_INT_IRQHandler               [WEAK]
                EXPORT  AGT1_COMPARE_A_IRQHandler         [WEAK]
                EXPORT  AGT1_COMPARE_B_IRQHandler         [WEAK]
                EXPORT  AGT2_INT_IRQHandler               [WEAK]
                EXPORT  AGT2_COMPARE_A_IRQHandler         [WEAK]
                EXPORT  AGT2_COMPARE_B_IRQHandler         [WEAK]
                EXPORT  AGT3_INT_IRQHandler               [WEAK]
                EXPORT  AGT3_COMPARE_A_IRQHandler         [WEAK]
                EXPORT  AGT3_COMPARE_B_IRQHandler         [WEAK]
                EXPORT  AGT4_INT_IRQHandler               [WEAK]
                EXPORT  AGT4_COMPARE_A_IRQHandler         [WEAK]
                EXPORT  AGT4_COMPARE_B_IRQHandler         [WEAK]
                EXPORT  AGT5_INT_IRQHandler               [WEAK]
                EXPORT  AGT5_COMPARE_A_IRQHandler         [WEAK]
                EXPORT  AGT5_COMPARE_B_IRQHandler         [WEAK]
                EXPORT  IWDT_UNDERFLOW_IRQHandler         [WEAK]
                EXPORT  WDT_UNDERFLOW_IRQHandler          [WEAK]
                EXPORT  RTC_ALARM_IRQHandler              [WEAK]
                EXPORT  RTC_PERIOD_IRQHandler             [WEAK]
                EXPORT  RTC_CARRY_IRQHandler              [WEAK]
                EXPORT  USBFS_FIFO_0_IRQHandler           [WEAK]
                EXPORT  USBFS_FIFO_1_IRQHandler           [WEAK]
                EXPORT  USBFS_INT_IRQHandler              [WEAK]
                EXPORT  USBFS_RESUME_IRQHandler           [WEAK]
                EXPORT  IIC0_RXI_IRQHandler               [WEAK]
                EXPORT  IIC0_TXI_IRQHandler               [WEAK]
                EXPORT  IIC0_TEI_IRQHandler               [WEAK]
                EXPORT  IIC0_ERI_IRQHandler               [WEAK]
                EXPORT  IIC0_WUI_IRQHandler               [WEAK]
                EXPORT  IIC1_RXI_IRQHandler               [WEAK]
                EXPORT  IIC1_TXI_IRQHandler               [WEAK]
                EXPORT  IIC1_TEI_IRQHandler               [WEAK]
                EXPORT  IIC1_ERI_IRQHandler               [WEAK]
                EXPORT  SDHIMMC0_ACCS_IRQHandler          [WEAK]
                EXPORT  SDHIMMC0_SDIO_IRQHandler          [WEAK]
                EXPORT  SDHIMMC0_CARD_IRQHandler          [WEAK]
                EXPORT  SDHIMMC0_DMA_REQ_IRQHandler       [WEAK]
                EXPORT  SSI0_TXI_IRQHandler               [WEAK]
                EXPORT  SSI0_RXI_IRQHandler               [WEAK]
                EXPORT  SSI0_INT_IRQHandler               [WEAK]
                EXPORT  CTSU_WRITE_IRQHandler             [WEAK]
                EXPORT  CTSU_READ_IRQHandler              [WEAK]
                EXPORT  CTSU_END_IRQHandler               [WEAK]
                EXPORT  CAC_FREQUENCY_ERROR_IRQHandler    [WEAK]
                EXPORT  CAC_MEASUREMENT_END_IRQHandler    [WEAK]
                EXPORT  CAC_OVERFLOW_IRQHandler           [WEAK]
                EXPORT  CAN0_ERROR_IRQHandler             [WEAK]
                EXPORT  CAN0_FIFO_RX_IRQHandler           [WEAK]
                EXPORT  CAN0_FIFO_TX_IRQHandler           [WEAK]
                EXPORT  CAN0_MAILBOX_RX_IRQHandler        [WEAK]
                EXPORT  CAN0_MAILBOX_TX_IRQHandler        [WEAK]
                EXPORT  CAN1_ERROR_IRQHandler             [WEAK]
                EXPORT  CAN1_FIFO_RX_IRQHandler           [WEAK]
                EXPORT  CAN1_FIFO_TX_IRQHandler           [WEAK]
                EXPORT  CAN1_MAILBOX_RX_IRQHandler        [WEAK]
                EXPORT  CAN1_MAILBOX_TX_IRQHandler        [WEAK]
                EXPORT  IOPORT_EVENT_1_IRQHandler         [WEAK]
                EXPORT  IOPORT_EVENT_2_IRQHandler         [WEAK]
                EXPORT  IOPORT_EVENT_3_IRQHandler         [WEAK]
                EXPORT  IOPORT_EVENT_4_IRQHandler         [WEAK]
                EXPORT  ELC_SOFTWARE_EVENT_0_IRQHandler   [WEAK]
                EXPORT  ELC_SOFTWARE_EVENT_1_IRQHandler   [WEAK]
                EXPORT  POEG0_EVENT_IRQHandler            [WEAK]
                EXPORT  POEG1_EVENT_IRQHandler            [WEAK]
                EXPORT  POEG2_EVENT_IRQHandler            [WEAK]
                EXPORT  POEG3_EVENT_IRQHandler            [WEAK]
                EXPORT  GPT0_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT0_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT0_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT0_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT0_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT0_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT0_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT0_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT0_PC_IRQHandler                [WEAK]
                EXPORT  GPT1_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT1_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT1_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT1_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT1_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT1_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT1_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT1_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT1_PC_IRQHandler                [WEAK]
                EXPORT  GPT2_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT2_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT2_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT2_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT2_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT2_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT2_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT2_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT3_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT3_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT3_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT3_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT3_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT3_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT3_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT3_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT4_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT4_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT4_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT4_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT4_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT4_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT4_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT4_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT4_PC_IRQHandler                [WEAK]
                EXPORT  GPT5_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT5_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT5_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT5_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT5_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT5_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT5_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT5_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT5_PC_IRQHandler                [WEAK]
                EXPORT  GPT6_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT6_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT6_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT6_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT6_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT6_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT6_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT6_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT6_PC_IRQHandler                [WEAK]
                EXPORT  GPT7_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT7_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT7_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT7_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT7_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT7_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT7_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT7_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT8_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT8_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT8_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT8_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT8_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT8_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT8_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT8_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT9_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT9_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT9_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT9_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT9_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT9_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT9_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT9_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  OPS_UVW_EDGE_IRQHandler           [WEAK]
                EXPORT  ADC0_SCAN_END_IRQHandler          [WEAK]
                EXPORT  ADC0_SCAN_END_B_IRQHandler        [WEAK]
                EXPORT  ADC0_WINDOW_A_IRQHandler          [WEAK]
                EXPORT  ADC0_WINDOW_B_IRQHandler          [WEAK]
                EXPORT  ADC0_COMPARE_MATCH_IRQHandler     [WEAK]
                EXPORT  ADC0_COMPARE_MISMATCH_IRQHandler  [WEAK]
                EXPORT  ADC1_SCAN_END_IRQHandler          [WEAK]
                EXPORT  ADC1_SCAN_END_B_IRQHandler        [WEAK]
                EXPORT  ADC1_WINDOW_A_IRQHandler          [WEAK]
                EXPORT  ADC1_WINDOW_B_IRQHandler          [WEAK]
                EXPORT  ADC1_COMPARE_MATCH_IRQHandler     [WEAK]
                EXPORT  ADC1_COMPARE_MISMATCH_IRQHandler  [WEAK]
                EXPORT  EDMAC0_EINT_IRQHandler            [WEAK]
                EXPORT  SCI0_RXI_IRQHandler               [WEAK]
                EXPORT  SCI0_TXI_IRQHandler               [WEAK]
                EXPORT  SCI0_TEI_IRQHandler               [WEAK]
                EXPORT  SCI0_ERI_IRQHandler               [WEAK]
                EXPORT  SCI0_AM_IRQHandler                [WEAK]
                EXPORT  SCI0_RXI_OR_ERI_IRQHandler        [WEAK]
                EXPORT  SCI1_RXI_IRQHandler               [WEAK]
                EXPORT  SCI1_TXI_IRQHandler               [WEAK]
                EXPORT  SCI1_TEI_IRQHandler               [WEAK]
                EXPORT  SCI1_ERI_IRQHandler               [WEAK]
                EXPORT  SCI2_RXI_IRQHandler               [WEAK]
                EXPORT  SCI2_TXI_IRQHandler               [WEAK]
                EXPORT  SCI2_TEI_IRQHandler               [WEAK]
                EXPORT  SCI2_ERI_IRQHandler               [WEAK]
                EXPORT  SCI3_RXI_IRQHandler               [WEAK]
                EXPORT  SCI3_TXI_IRQHandler               [WEAK]
                EXPORT  SCI3_TEI_IRQHandler               [WEAK]
                EXPORT  SCI3_ERI_IRQHandler               [WEAK]
                EXPORT  SCI3_AM_IRQHandler                [WEAK]
                EXPORT  SCI4_RXI_IRQHandler               [WEAK]
                EXPORT  SCI4_TXI_IRQHandler               [WEAK]
                EXPORT  SCI4_TEI_IRQHandler               [WEAK]
                EXPORT  SCI4_ERI_IRQHandler               [WEAK]
                EXPORT  SCI4_AM_IRQHandler                [WEAK]
                EXPORT  SCI5_RXI_IRQHandler               [WEAK]
                EXPORT  SCI5_TXI_IRQHandler               [WEAK]
                EXPORT  SCI5_TEI_IRQHandler               [WEAK]
                EXPORT  SCI5_ERI_IRQHandler               [WEAK]
                EXPORT  SCI5_AM_IRQHandler                [WEAK]
                EXPORT  SCI6_RXI_IRQHandler               [WEAK]
                EXPORT  SCI6_TXI_IRQHandler               [WEAK]
                EXPORT  SCI6_TEI_IRQHandler               [WEAK]
                EXPORT  SCI6_ERI_IRQHandler               [WEAK]
                EXPORT  SCI6_AM_IRQHandler                [WEAK]
                EXPORT  SCI7_RXI_IRQHandler               [WEAK]
                EXPORT  SCI7_TXI_IRQHandler               [WEAK]
                EXPORT  SCI7_TEI_IRQHandler               [WEAK]
                EXPORT  SCI7_ERI_IRQHandler               [WEAK]
                EXPORT  SCI7_AM_IRQHandler                [WEAK]
                EXPORT  SCI8_RXI_IRQHandler               [WEAK]
                EXPORT  SCI8_TXI_IRQHandler               [WEAK]
                EXPORT  SCI8_TEI_IRQHandler               [WEAK]
                EXPORT  SCI8_ERI_IRQHandler               [WEAK]
                EXPORT  SCI8_AM_IRQHandler                [WEAK]
                EXPORT  SCI9_RXI_IRQHandler               [WEAK]
                EXPORT  SCI9_TXI_IRQHandler               [WEAK]
                EXPORT  SCI9_TEI_IRQHandler               [WEAK]
                EXPORT  SCI9_ERI_IRQHandler               [WEAK]
                EXPORT  SCI9_AM_IRQHandler                [WEAK]
                EXPORT  SCIX0_SCIX0_IRQHandler            [WEAK]
                EXPORT  SCIX0_SCIX1_IRQHandler            [WEAK]
                EXPORT  SCIX0_SCIX2_IRQHandler            [WEAK]
                EXPORT  SCIX0_SCIX3_IRQHandler            [WEAK]
                EXPORT  SCIX1_SCIX0_IRQHandler            [WEAK]
                EXPORT  SCIX1_SCIX1_IRQHandler            [WEAK]
                EXPORT  SCIX1_SCIX2_IRQHandler            [WEAK]
                EXPORT  SCIX1_SCIX3_IRQHandler            [WEAK]
                EXPORT  SPI0_RXI_IRQHandler               [WEAK]
                EXPORT  SPI0_TXI_IRQHandler               [WEAK]
                EXPORT  SPI0_IDLE_IRQHandler              [WEAK]
                EXPORT  SPI0_ERI_IRQHandler               [WEAK]
                EXPORT  SPI0_TEI_IRQHandler               [WEAK]
                EXPORT  SPI1_RXI_IRQHandler               [WEAK]
                EXPORT  SPI1_TXI_IRQHandler               [WEAK]
                EXPORT  SPI1_IDLE_IRQHandler              [WEAK]
                EXPORT  SPI1_ERI_IRQHandler               [WEAK]
                EXPORT  SPI1_TEI_IRQHandler               [WEAK]
                EXPORT  OSPI_INT_IRQHandler               [WEAK]
                EXPORT  QSPI_INT_IRQHandler               [WEAK]
                EXPORT  DOC_INT_IRQHandler                [WEAK]

